Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkTagsAttributes.TagA2 Property
 The tag A2 of a mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkBase.SectionMarkTagAttributes TagA2 { get; set; }
Public Property TagA2 As SectionMarkBase.SectionMarkTagAttributes
	Get
	Set
Property Value
Type: SectionMarkBase.SectionMarkTagAttributes
See Also
Reference
SectionMarkBase.SectionMarkTagsAttributes Class
Tekla.Structures.Drawing Namespace